{
    "nav":{
        "courses":"Courses"
    }
    ,
    "Professional Training":{
        "title":"Professional Training",
        "description":"Don't let your grades stop you from reaching your dream job! If you love journalism and media 🎥🎤 and dream of becoming a journalist or presenter, then your place is with us in the professional training program in journalism and media at the International Building Center. The opportunity is open to all high school, Al-Azhar, and diploma graduates, as well as institute and university students, without restrictions on the year of graduation! 👨‍🎓👩‍🎓",
        "Training Information":{
            "title1":"Journalism and Media",
            "Journalism and Media":{
                "mainTitle":"Journalism and Media Section",
                "description":"The International Building Center in the Journalism and Media Department provides outstanding education that embraces diversity and aims to transfer knowledge while adhering to media education quality standards. Trainees will study the following sections within the Media Section:",
                "point1":"Journalism and Digital Publishing Section",
                "point2":"Public Relations and Marketing Communications Section",
                "point3":"Radio and Television Section",
                "subtitle":"One of the key features of the center:",
                "point4":"Modern programs and curricula that align with the needs of the job market in various media specialties.",
                "point5":"The faculty members have the highest level of academic expertise.",
                "point6":"Training for students at major journalistic and media institutions through partnerships with many private organizations.",
                "point7":"Conducting courses and workshops",
                "point8":"Holding seminars and discussion panels with journalists and media professionals in various specialties.",
                "point9":"Starting practical training and job market simulation in studios and labs affiliated with the center from the beginning of the student's enrollment at the center.",
                "point10":"Providing summer training within accredited media institutions and news websites in accordance with many cooperation protocols.",
                "point11":"We teach you writing, editing, directing, photography, production, radio and television.",
                "point12":"We will also teach you how to be a professional journalist who can deliver information to people in a correct and objective way.",
                "point13":"Visits are organized periodically to major media institutions such as (Youm7, Al-Watan Newspaper, Trend News, Channel 7).",
                "subtitle2":"Graduate work areas:",
                "point14":"Website design, journalistic writing.",
                "point15":"Public relations and marketing in companies, institutions, banks and advertising companies.",
                "point16":"Radio and television as a director, broadcaster, or producer of television or radio programmes."
                }
        },
        "title2":"Tourism and Hotels Section",
        "description2":"It is considered one of the most important departments that we offer at the International Construction Center because we have advantages that distinguish us from others (because we have permanent license No. 7 at the republic level and the first at the Upper Egypt level)",
        "Tourism and Hotels":{
            "point1":"We prepare you for the labor market.",
            "point2":"You will learn from experts and international chefs.",
            "point3":"She studies the basics of hotel and tourism services, as well as languages, airline and tourism business.",
            "point4":"Practical training in major hotels, restaurants, airlines and tourism companies.",
            "point5":"You will receive tools and clothing for practicing the profession.",
            "point6":"Training and practical work are the main focus of the study.",
            "subtitle":"And don't forget the accredited certificates:",
            "point7":"Certificates of experience and training from major hotels, restaurants, tourism and travel companies.",
            "point8":"Support with courses and grants in languages ​​and hotel services available at the center."
        },
        "title3":"Surveying and Mapping Section",
        "description3":"It is considered one of the most important departments that we offer at the International Construction Center because we have advantages that distinguish us from others (because we have permanent license No. 7 at the republic level and the first at the Upper Egypt level)",
        "Surveying and Mapping":{
            "point1":"You will be trained by highly experienced engineers and university professors.",
            "point2":"Practical training within major construction, contracting and surveying companies.",
            "point3":"You will receive a helmet, safety vest and professional practice tools.",
            "point4":"Training and practical work is the main focus of the study.",
            "subtitle":"And don't forget the accredited certificates:",
            "point5":"Certificates of experience from practical training in the Surveying and Mapping Department.",
            "point6":"Support with courses and grants in surveying and mapping."
        }
        ,"title4": "Computer Section",
    "description4": "It is considered one of the most important sections that we offer at the International Construction Center because we have advantages that distinguish us from others (because we have permanent license No. 7 at the republic level and the first at the Upper Egypt level)",
    "ComputerSection":{
        "point1":"It is taught by experienced engineers and university professors.",
        "point2":"Training and practical work are the main focus of the study.",
        "subtitle1":"Creativa training is done within the university.",
        "point3":"The training will be practical in laboratories equipped with all types of modern devices.",
        "point4": "You study everything related to computer science, from computer networks, programming languages, hardware maintenance, and software.",
        "subtitle2":"Don't forget the approved certificates",
        "point5":"Certificates of experience from practical training in the computer section.",
        "point6": "Hardware and software certificate.",
        "point7": "Support with accredited courses and grants in computer science."
    },
    "title5": "Languages and Translation Section",
    "description5":"It is considered one of the most important departments that we offer at the International Construction Center because we have advantages that distinguish us from others (because we have permanent license No. 7 at the republic level and the first at the Upper Egypt level)",
    "Languages and Translation":{
        "subtitle1":"The Languages section includes the following specializations:",
        "point1":"German language 🇩🇪",
        "point2":"Italian language 🇮🇹 .",
        "point3":"English language 🇺🇸 .",
        "point4":"You will study the language of your choice during the two years.",
        "point5":"You will be trained by the most prominent university professors and certified translators.",
        "point6":"The main focus of the study is on pronunciation and actual practice of the language.",
        "point7":"Also, practical training in major certified translators' offices.",
        "subtitle2":"And don't forget the approved certificates:",
        "point8":"Certificate of experience from one of the largest certified translation offices.",
        "point9":"Support with language courses and scholarships available at the center."
    },
    "title6":"Business Administration and Secretarial Studies Section",
    "description6":"It is considered one of the most important sections that we offer at the International Construction Center because we have advantages that distinguish us from others (because we have permanent license No. 7 at the republic level and the first at the Upper Egypt level)"
    ,"Business":{
        "point1":"Taught by experienced accountants and university professors.",
        "point2":"Training and practical work is the main focus of the study.",
        "point3":"You will study practical work in major tax and legal accounting offices.",
        "point4":"You will learn business administration with ease because you will receive practical training in the Tax Authority.",
        "point5":"You will learn and practice what you have learned practically on real work to keep pace with developments in the labor market.",
        "point6":"You can do the equation and complete the Faculty of Commerce through us.",
        "subtitle":"Don't forget the approved certificates",    
        "point7":"Certificate of experience from one of the largest entrepreneurship and corporate accounting companies.",
        "point8":"Certificate of experience from a major legal and tax accounting office."
    },
     "mainTitlePart1":"Health Services Section",
    "mainTitlePart2":"Nursing and Emergency Specialization - Analysis and Radiology Specialization",
    "title7":"Health Services Section",
    "description7":"It is considered one of the most important sections that we offer at the International Construction Center because we have advantages that distinguish us from others (because we have permanent license No. 7 at the republic level and the first at the Upper Egypt level)",
    "point1":"You will be trained by expert doctors, nurses and university professors.",
    "point2":"Practical training during study in government and private hospitals.",
    "point3":"Training in analysis laboratories equipped with all devices.",
    "point4":"You will learn all the medical terms that will qualify you to work in the largest hospitals.",
    "point5":"The main focus of the study is practical training.",
    "subtitle":"And don't forget the accredited certificates:",
    "point6":"You will get certificates of experience and training from the hospitals where you will receive practical training.",
    "point7":"You will get a certificate accredited by the largest government universities.",
    "point8":"Support with courses to keep up with the job market."


    ,"application":{
        "title":"Submit an application",
        "name":"Name",
        "phone":"Phone Number",
        "Educational qualification":"Educational qualification",
        "option1":"The section you want to join?"
    },
    "Complaints and Suggestions":{
        "title":"Complaints and Suggestions",
        "address":"Address",
        "addressDes":"Saad Zaghloul Street (Station) - Next to the Egyptian Post - Andalusia Tower (A) - First Floor, Administrative, Minya, Egypt.",
        "contact":"Contact Information",
        "email":"Email",
        "name":"name",
        "subject":"Subject",
        "message":"Message",
        "send":"Send"

    }
    }
}


