{
  "nav": {
    "courses": "Courses",
    "contact": "Contact Us"
  },
  "aboutCourses": {
    "title": "About Courses",
    "course1": "3D Max Course",
    "course2": "Surveying Course",
    "course3": "AuToCAD Course",
    "course4": "Technical Office Diploma",
    "course5": "Geographic Information Systems (GIS) Diploma",
    "course6": "Architectural Revit Course",
    "course7": "Electrical Engineering Course for Construction Sites and Buildings",
    "course8": "Graphic Design Diploma",
    "course9": "Surveying and Integrated Planning Diploma",
    "course10": "Quantity Surveying Course",
    "course11": "Site Engineer Preparation Diploma",
    "course12": "Summer Training for Engineering and Surveying Faculties",
    "course13": "HTML Course",
    "course14": "Scratch Program",
    "course15": "ICDL",
    "course16": "First Aid Course",
    "applyCourse": {
      "title": "Course Reservation Submission",
      "name": "Name",
      "email": "Email",
      "phone": "Phone Number",
      "Qualification": "Academic Qualification",
      "selection": "Which course or diploma would you like to reserve?",
      "submit": "Submit"
    },
    "enquiry": {
      "title": "Inquiry About a Course",
      "selection": "Which course or diploma would you like to inquire about?",
      "question": "Your Inquiry"
    },
    "problems": {
      "title": "Complaints and Suggestions",
      "address": "Address",
      "addressDetails": "Saad Zaghloul Street (Station) - Next to the Egyptian Post - Andalus Tower (A) - First Floor, Administrative, Minya, Egypt.",
      "detials": "Contact Information",
      "subject": "Subject",
      "message": "Message",
      "send": "Send"
    },
    "dropDown": {
      "first": "Course Information",
      "sec": "Course Enrollment Request",
      "third": "Inquiry About a Course",
      "fourth": "Complaints and Suggestions"
    }
  },
  "contact": {
    "title": "Contact Us",
    "description": "International Construction Investment and Development Company, an Egyptian Joint Stock Company #Investment_in_Love_for_Egypt 🇪🇬"
  },
  "firstAidCourse": {
    "title": "You will learn how to use surveying instruments like the level and total station, and you will go for practical training to work with the instruments yourself.",
    "subtitle": "Theoretical lectures",
    "title1": "Fractures and splints",
    "title2": "Dislocations",
    "title3": "Burns and frostbite",
    "title4": "Wounds and internal bleeding",
    "title5": "Food poisoning and gas poisoning",
    "title6": "Overdose poisoning",
    "title7": "Fainting and recovery position",
    "title8": "Heart attack",
    "subtitle2": "Practical training",
    "title9": "Cardiopulmonary Resuscitation (CPR)",
    "title10": "Measuring blood pressure, pulse, respiration, and temperature",
    "title11": "Intramuscular and intravenous injections",
    "title12": "Allergy test",
    "title13": "How to collect samples"
  },
  "ICDL": {
    "title": "In construction, you train and learn from experts and professionals with many years of experience, truly preparing for the job market—not just taking a course and that's it.",
    "title1": "You will learn how to choose your device.",
    "title2": "We will learn how to work with Windows",
    "title3": "We will learn how to manage files and the practical way to organize them.",
    "title4": "We will learn how to compress and decompress files and set a password.",
    "title5": "We will learn how to install and uninstall programs.",
    "title6": "We will learn the difference between the 64-bit version and the 32-bit (or 86) version",
    "title7": "We will learn how to retrieve hidden files from a USB flash drive.",
    "subtitle": "Inshallah, we will learn a lot during the course, which will be beneficial whether you need to create a presentation for yourself or work with formulas and large numbers. We will also cover infographics, which are extremely useful and can be applied in many areas. The topics mentioned are just examples—we will be learning much more throughout the course.If you're looking to build a CV for a course that includes all 7 modules (Word, Excel, PowerPoint, Access, IT, Windows, and Internet), this course will cover everything. Each program will be explained in detail, and you will practice and apply everything you learn.We will start with Microsoft Word and go through each program step by step.",
    "subtitle2": "You will learn the basic menus File - Home - Insert - Design - Layout - Review Power Point program You will learn how to make a distinctive presentation SmartArt - Transition - Animation - Slide Show Excel program You will learn how to format tables and charts Styles Tables - Charts Link - Sheet Options Access program You will learn how to create a database with tables and codes, enter data, modify it, and also delete data. Create table in design view - Create table in sql code - Insert into data - Update date - Delete data",
    "subtitle3": "Course duration: one month",
    "subtitle4": "Trainer Engineer: Rofida"
  },
  "scratch": {
    "title1": "Many parents now want to see their children excel and no longer want to instill the idea that they must become doctors or engineers, and that anything else means failure or lack of intelligence. However, this mindset has changed. Some parents now prefer to see their children stand out from the rest or pursue what they truly love, which will ultimately make them excel in it.",
    "title2": "Nowadays, children are highly engaged with technology, especially video games. So why not open the door for them to study what they are passionate about? That’s why we will teach them programming through Scratch, a specialized program designed to introduce children to coding.",
    "subtitle": "Advantages of Scratch",
    "p1": "Supports Arabic and English.",
    "p2": "Teaching children multiple programming languages is important for them.",
    "p3": "Providing a unique environment of games and graphic stories for children.",
    "p4": "Developing children's creativity and enhancing their various skills.",
    "p5": "The Scratch program is suitable for all age groups who use it.",
    "p6": "It supports multiple languages, with Arabic being one of the most important.",
    "p7": " It provides a large amount of visual and audio content for users free of charge.",
    "p8": "Reducing the difficulties presented by programming languages.",
    "p9": "Early and simplified learning of various programming languages.",
    "subtitle2": "Projects and Application Levels of the Scratch Program",
    "p10": "Level 1: Controlling the Movement of Objects",
    "p11": "Level 2: Changing the Appearance of Objects.",
    "p12": "Level 3: Creating an Interactive Game.",
    "p13": "Level 4: Creating a Dialogue Between Two Characters.",
    "p14": "Course Duration: 8 lectures, twice a week.",
    "p15": "Trainer Engineer: Rofida"
  },
  "summer": {
    "title": "A great opportunity for engineering and surveying students. The Training Administration announces the opening of applications for the summer training program for students of Engineering Colleges, the Faculty of Arts (Surveying Department), and governmental and private engineering and surveying institutes at Al-Benaa Institution. The application period is from 15/4/2022 to 31/6/2022.",
    "p1": "Fully equipped sites with all the necessary devices.",
    "p2": "Upon completion, you receive an experience certificate.",
    "p3": "You will be trained by experienced engineers in the field.",
    "p4": "Available Departments: Architectural, Civil, Electrical, and Surveying."
  },
  "Professional Training": {
    "title": "Professional Training",
    "description": "Don't let your grades stop you from reaching your dream job! If you love journalism and media 🎥🎤 and dream of becoming a journalist or presenter, then your place is with us in the professional training program in journalism and media at the International Building Center. The opportunity is open to all high school, Al-Azhar, and diploma graduates, as well as institute and university students, without restrictions on the year of graduation! 👨‍🎓👩‍🎓",
    "Training Information": {
      "title1": "Journalism and Media",
      "Journalism and Media": {
        "mainTitle": "Journalism and Media Section",
        "description": "The International Building Center in the Journalism and Media Department provides outstanding education that embraces diversity and aims to transfer knowledge while adhering to media education quality standards. Trainees will study the following sections within the Media Section:",
        "point1": "Journalism and Digital Publishing Section",
        "point2": "Public Relations and Marketing Communications Section",
        "point3": "Radio and Television Section",
        "subtitle": "One of the key features of the center:",
        "point4": "Modern programs and curricula that align with the needs of the job market in various media specialties.",
        "point5": "The faculty members have the highest level of academic expertise.",
        "point6": "Training for students at major journalistic and media institutions through partnerships with many private organizations.",
        "point7": "Conducting courses and workshops",
        "point8": "Holding seminars and discussion panels with journalists and media professionals in various specialties.",
        "point9": "Starting practical training and job market simulation in studios and labs affiliated with the center from the beginning of the student's enrollment at the center.",
        "point10": "Providing summer training within accredited media institutions and news websites in accordance with many cooperation protocols.",
        "point11": "We teach you writing, editing, directing, photography, production, radio and television.",
        "point12": "We will also teach you how to be a professional journalist who can deliver information to people in a correct and objective way.",
        "point13": "Visits are organized periodically to major media institutions such as (Youm7, Al-Watan Newspaper, Trend News, Channel 7).",
        "subtitle2": "Graduate work areas:",
        "point14": "Website design, journalistic writing.",
        "point15": "Public relations and marketing in companies, institutions, banks and advertising companies.",
        "point16": "Radio and television as a director, broadcaster, or producer of television or radio programmes."
      }
    },
    "title2": "Tourism and Hotels Section",
    "description2": "It is considered one of the most important departments that we offer at the International Construction Center because we have advantages that distinguish us from others (because we have permanent license No. 7 at the republic level and the first at the Upper Egypt level)",
    "Tourism and Hotels": {
      "point1": "We prepare you for the labor market.",
      "point2": "You will learn from experts and international chefs.",
      "point3": "She studies the basics of hotel and tourism services, as well as languages, airline and tourism business.",
      "point4": "Practical training in major hotels, restaurants, airlines and tourism companies.",
      "point5": "You will receive tools and clothing for practicing the profession.",
      "point6": "Training and practical work are the main focus of the study.",
      "subtitle": "And don't forget the accredited certificates:",
      "point7": "Certificates of experience and training from major hotels, restaurants, tourism and travel companies.",
      "point8": "Support with courses and grants in languages ​​and hotel services available at the center."
    },
    "title3": "Surveying and Mapping Section",
    "description3": "It is considered one of the most important departments that we offer at the International Construction Center because we have advantages that distinguish us from others (because we have permanent license No. 7 at the republic level and the first at the Upper Egypt level)",
    "Surveying and Mapping": {
      "point1": "You will be trained by highly experienced engineers and university professors.",
      "point2": "Practical training within major construction, contracting and surveying companies.",
      "point3": "You will receive a helmet, safety vest and professional practice tools.",
      "point4": "Training and practical work is the main focus of the study.",
      "subtitle": "And don't forget the accredited certificates:",
      "point5": "Certificates of experience from practical training in the Surveying and Mapping Department.",
      "point6": "Support with courses and grants in surveying and mapping."
    },
    "title4": "Computer Section",
    "description4": "It is considered one of the most important sections that we offer at the International Construction Center because we have advantages that distinguish us from others (because we have permanent license No. 7 at the republic level and the first at the Upper Egypt level)",
    "ComputerSection": {
      "point1": "It is taught by experienced engineers and university professors.",
      "point2": "Training and practical work are the main focus of the study.",
      "subtitle1": "Creativa training is done within the university.",
      "point3": "The training will be practical in laboratories equipped with all types of modern devices.",
      "point4": "You study everything related to computer science, from computer networks, programming languages, hardware maintenance, and software.",
      "subtitle2": "Don't forget the approved certificates",
      "point5": "Certificates of experience from practical training in the computer section.",
      "point6": "Hardware and software certificate.",
      "point7": "Support with accredited courses and grants in computer science."
    },
    "title5": "Languages and Translation Section",
    "description5": "It is considered one of the most important departments that we offer at the International Construction Center because we have advantages that distinguish us from others (because we have permanent license No. 7 at the republic level and the first at the Upper Egypt level)",
    "Languages and Translation": {
      "subtitle1": "The Languages section includes the following specializations:",
      "point1": "German language 🇩🇪",
      "point2": "Italian language 🇮🇹 .",
      "point3": "English language 🇺🇸 .",
      "point4": "You will study the language of your choice during the two years.",
      "point5": "You will be trained by the most prominent university professors and certified translators.",
      "point6": "The main focus of the study is on pronunciation and actual practice of the language.",
      "point7": "Also, practical training in major certified translators' offices.",
      "subtitle2": "And don't forget the approved certificates:",
      "point8": "Certificate of experience from one of the largest certified translation offices.",
      "point9": "Support with language courses and scholarships available at the center."
    },
    "title6": "Business Administration and Secretarial Studies Section",
    "description6": "It is considered one of the most important sections that we offer at the International Construction Center because we have advantages that distinguish us from others (because we have permanent license No. 7 at the republic level and the first at the Upper Egypt level)",
    "Business": {
      "point1": "Taught by experienced accountants and university professors.",
      "point2": "Training and practical work is the main focus of the study.",
      "point3": "You will study practical work in major tax and legal accounting offices.",
      "point4": "You will learn business administration with ease because you will receive practical training in the Tax Authority.",
      "point5": "You will learn and practice what you have learned practically on real work to keep pace with developments in the labor market.",
      "point6": "You can do the equation and complete the Faculty of Commerce through us.",
      "subtitle": "Don't forget the approved certificates",
      "point7": "Certificate of experience from one of the largest entrepreneurship and corporate accounting companies.",
      "point8": "Certificate of experience from a major legal and tax accounting office."
    },
    "mainTitlePart1": "Health Services Section",
    "mainTitlePart2": "Nursing and Emergency Specialization - Analysis and Radiology Specialization",
    "title7": "Health Services Section",
    "description7": "It is considered one of the most important sections that we offer at the International Construction Center because we have advantages that distinguish us from others (because we have permanent license No. 7 at the republic level and the first at the Upper Egypt level)",
    "point1": "You will be trained by expert doctors, nurses and university professors.",
    "point2": "Practical training during study in government and private hospitals.",
    "point3": "Training in analysis laboratories equipped with all devices.",
    "point4": "You will learn all the medical terms that will qualify you to work in the largest hospitals.",
    "point5": "The main focus of the study is practical training.",
    "subtitle": "And don't forget the accredited certificates:",
    "point6": "You will get certificates of experience and training from the hospitals where you will receive practical training.",
    "point7": "You will get a certificate accredited by the largest government universities.",
    "point8": "Support with courses to keep up with the job market.",
    "application": {
      "title": "Submit an application",
      "name": "Name",
      "phone": "Phone Number",
      "Educational qualification": "Educational qualification",
      "option1": "The section you want to join?"
    },
    "Complaints and Suggestions": {
      "title": "Complaints and Suggestions",
      "address": "Address",
      "addressDes": "Saad Zaghloul Street (Station) - Next to the Egyptian Post - Andalusia Tower (A) - First Floor, Administrative, Minya, Egypt.",
      "contact": "Contact Information",
      "email": "Email",
      "name": "name",
      "subject": "Subject",
      "message": "Message",
      "send": "Send"
    }
  },
  "Albenaa company": {
    "albenaa": "Albenaa Company",
    "page1": {
      "title": "Albenaa Company history",
      "description": "Albenaa International, General Contracting and Surveying Company is a specialized company in the field of engineering, construction and maintenance of civil works facilities, homes, complexes, schools and hospitals. And any type of construction categories. Beginning to enter the construction market and achieved its reputation after completing the work in a timely manner from distinctive projects. By adopting cost-effective techniques and distinctive quality levels and other types of projects to achieve the highest international standards, and achieving the complete satisfaction of our customers, projects have been completed in the following sectors: government, military, residential and commercial. We have the confidence and experience to work either directly or as a contractor for a joint project and implement quality technical support services and ensure that the projects undertaken by the company meet the specifications and requirements of our customers and are completed on time.",
      "General Contracting": "General Contracting",
      "p1": "General contracting for residential buildings, prefabricated buildings, steel buildings, construction, demolition, building restoration, operation, maintenance and cleaning of residential and commercial buildings.",
      "p2": "Production of ready-mix concrete, tiles and cement blocks.",
      "p3": "Road works contracting, including earthworks, asphalt and lighting.",
      "p4": "Water and sewage works, maintenance and operation of water and sewage treatment plants and electrical installations",
      "p5": "Electrical works contracting, including power generation, transmission and transformation stations.",
      "p6": "Mechanical works (cooling and central air conditioning systems works).",
      "p7": "Electronic business, wired and wireless communications networks, computer networks and automatic control systems.",
      "p8": "Non-agricultural heavy equipment rental.",
      "p9": "Industrial business.",
      "p10": "Marine works include repair of shipyards and marine piers, drilling and driving of piles, deepening and cleaning works, extensions and underwater tunnels.",
      "p11": "Coordination and landscaping of gardens, organization of sites, landscaping of streets, gardens and parks, and their maintenance and operation.",
      "Our partners": "Our Partners",
      "title1": "Albenaa Company contributed to:",
      "subtitle1": {
        "title": "New Alamein City Authority",
        "p1": "City Edge. New Alamein Project",
        "p2": "Project to establish a residential and recreational complex with 37 villas and 4 chalets on an area of ​​37 acres in New Alamein City",
        "p3": "Project to establish the international coastal road island extending from the gate of El Alamein City to the gate of Sidi Abdel Rahman"
      },
      "subtitle2": {
        "title": "Educational Buildings Authority",
        "p1": "Al-Aqoula Elementary School Construction Project",
        "p2": "Project to establish Al-Aqla one-classroom school in Baltim Center, Burullus City, Kafr El-Sheikh Governorate",
        "p3": "Al-Ghabaisheh Preparatory School Construction Project",
        "p4": "Al-Ghabaishah One-Classroom School Construction Project in Sidi Salem Center, Kafr El-Sheikh Governorate"
      },
      "subtitle3": {
        "title": "Housing and Reconstruction Authority in Kafr El Sheikh",
        "p1": "Project to establish 6 buildings in Desouk Center, Kafr El-Sheikh Governorate",
        "p2": "Housing and Utilities Directorate Project in Kafr El-Sheikh Governorate",
        "p3": "Al-Hamrawy Veterinary Hospital Construction Project",
        "p4": "Al-Hamrawy General Hospital Maintenance, Development and Upgrading Project"
      },
      "subtitle4": {
        "title": "Housing and Reconstruction Authority in Minya",
        "p1": "The project to establish the (Aba) service complex in Maghagha within the Decent Life projects"
      },
      "subtitle5": {
        "title": "Ministry of Irrigation in Minya",
        "p1": "Lining and rehabilitation project of Farag Canal in Dayr Mawas Center in Minya Governorate as part of Decent Life projects",
        "p2": "Lining and rehabilitation project of Diab Canal in Abu Qurqas Center in Minya Governorate as part of Decent Life projects"
      },
      "subtitle6": {
        "title": "Construction and general contracting",
        "p1": "Construction and architectural designs",
        "p2": "Engineering consultations",
        "p3": "Public tenders",
        "p4": "Demolition and construction permits",
        "p5": "Finishing and decoration works",
        "p6": "Real estate investment"
      },
      "subtitle7": {
        "title": "Integrated surveying works",
        "p1": "Implementation of all construction works",
        "p2": "Implementation of all road and bridge works",
        "p3": "Implementation of all drainage and water works",
        "p4": "Implementation of all landscape works",
        "p5": "Implementation of all train works",
        "p6": "Division of agricultural lands",
        "p7": "Implementation of all types of budgets and networks",
        "p8": "Implementation of canal rehabilitation works",
        "p9": "Implementation of all mechanical and electrical works",
        "p10": "Sale, rental and calibration of all surveying devices (GPS_Total_Level- Drones) All works include technical office works."
      },
      "subtitle8": "الخدمات الإنشائية",
      "subtitle9": "التصميمات الهندسية"
    }
  },

  "html": {
  "subtitle": "It is the starting point for learning programming and web design, where you will gain essential skills.",
  "p1": "What is Web Design?",
  "p2": "You will learn about <head>, the codes written inside it, and its uses.",
  "p3": "You will learn how to write different types of headings and the formatting used in paragraphs.",
  "p4": "You will learn how to upload images, videos, and audio to the website.",
  "p5": "You will learn how to design tables and lists.",
  "p6": "You will learn how to fully design a form.",
  "p7": "You will learn how to use iframe.",
  "p8": "You will create a website design using HTML.",
  "p9": "You should know that HTML is a descriptive language, meaning it is used only to structure a webpage without adding any interactivity or visual styling. You can think of it as the skeleton of a human body. Then comes CSS, which is a styling language that enhances what you have built with HTML, adding aesthetics to the webpage, such as colors, fonts, button styles, and much more—CSS is a vast field. Additionally, JavaScript (JS) adds interactivity, making the page dynamic and functional. Together, these three languages form a complete system known as Front-End Development. If you master HTML, CSS, and JS, you can work as a Front-End Developer. However, to make your work easier, you should also learn frameworks like Bootstrap 5, which combines HTML, CSS, and JS in one place, making development faster and more efficient.",
  "p10": "To build a website, you must first learn HTML, followed by CSS. I recommend this approach because web development will be a new concept for you. The most important thing at this stage is to learn how to create and structure a webpage, add images, tables, and interactive elements such as forms, videos, and audio files, display content, and use different types of tags in HTML.",
  "p11": "By the way, you can build an entire website using only HTML without needing anything else. Of course, it won't be a practical or efficient website considering modern web development standards, but it serves as an example of the importance of HTML in learning web development.",
  "p12": "CSS comes later as a complementary styling tool, separating design elements such as colors, fonts, and buttons. It enhances the webpage you created using HTML by defining the appearance and layout of the content."
},
"revit":{
    "subtitle":"Now you can book your spot in our Architectural Revit course.",
    "p1":"You will get familiar with the program interface, all commands, and menus.",
    "p2":"You will learn massing techniques (Geometric, Organic, Parametric, Deconstructivist, and Classic).",
    "p3":"You will learn how to create working drawings.",
    "p4":"You will learn how to produce architectural drawings with an engineering company title block.",
    "p5":"You will learn how to draw plans, elevations, sections, and layouts.",
    "p6":"Practical application on 21 interior and exterior projects."
},
"autocad":{
    "title":"You will learn everything about the program, from the interface to executing a complete project with your own hands. You won’t finish the course without becoming a professional, guided by experts in the field.",
    "p1":"You will get familiar with the program interface, all commands, and menus.",
    "p2":"You will learn to master drawing Plans, Elevations, Sections, Layouts, and Details.",
    "p3":"In addition, you will learn how to work with X-REF.",
    "p4":"Practical application through a series of workshops on various projects with different uses.",
    "p5":"The course is available for booking in both online and offline formats."
},
"max":{
    "title":"3ds Max is widely used by major companies, and as an engineer, you will need it to present your work more realistically since your project will be in 3D. We will start with you from scratch to the professional level, beginning with selecting the right device, where and how to buy it, and the specifications you will need now and in the future.",
    "subtitle":"And we will start by installing the software and go through four important stages.",
    "p1":"Modeling.",
    "p2":" Material.",
    "p3":"Lighting.",
    "p4":"Material.",
    "p5":"And you will be working with V-Ray rendering, which is the most important tool currently. You will be able to produce a complete interior and exterior project. We will apply everything practically at every step as we work on Interior & Exterior projects together, and you will receive tasks for each stage to practice on.",
    "p6":"16 lectures, each lasting 2 hours."
},
"electric": {
    "title": "Course Content",
    "p1": "Introduction to project stakeholders and how to coordinate between them",
    "p2": "Steps for electrical project design and its requirements",
    "p3": "Basic equipment in electrical installations",
    "p4": "Medium voltage networks",
    "p5": "Transformers",
    "p6": "Emergency generators",
    "p7": "Electrical distribution panels",
    "p8": "Cables and electrical conductors",
    "p9": "Electrical protection devices",
    "p10": "How to read and apply electrical schematics",
    "p11": "Estimation of electrical loads",
    "p12": "Design of distribution panels, networks, and sub-circuits",
    "p13": "Power supply for main panels",
    "p14": "Design models",
    "p15": "Electrical lighting systems",
    "p16": "Lighting science",
    "p17": "Basic lighting quantities and units",
    "p18": "Lighting intensity calculations",
    "p19": "Grounding systems",
    "p20": "Grounding basics and its importance",
    "p21": "Components of the grounding system",
    "p22": "Calculation of ground resistance value",
    "p23": "Grounding in buildings",
    "p24": "Lightning and surge protection systems",
    "p25": "How to inspect electrical works",
    "p26": "Reviewing electrical works",
    "p27": "Electrical testing",
    "p28": "Sample acceptance checklists",
    "p29": "Instructor: Engineer Mohamed Shaaban"
  },
  "membership": {
    "title": "Membership Application",
    "f1": "Applicant's Name in Arabic",
    "f2": "Applicant's Name in English",
    "f3": "National ID",
    "f4": "Email",
    "f5": "Phone Number",
    "f6": "Governorate",
    "f7": "Address",
    "subtitle1": "Gender",
    "f8": "Female",
    "f9": "Male",
    "subtitle2": "Marital Status",
    "f10": "Single",
    "f11": "Married",
    "subtitle3": "Membership Type",
    "f12": "Diamond",
    "f13": "Gold",
    "f14": "Silver",
    "subtitle4": "Membership Plan",
    "f15": "Semi-Annual",
    "f16": "Annual",
    "f17": "Two Years",
    "f18": "Five Years",
    "subtitle5": "Membership Category",
    "f19": "Individual",
    "f20": "Family (For the five-year plan only)",
    "submit": "Submit"
  },
  "aboutMembership": {
    "title": "Memberships",
    "description": "Al-Binaa International Investment and Development Company - an Egyptian joint-stock company 1415 Investment Minya offers memberships. It is a membership that every individual needs to obtain numerous and diverse services in various aspects of life. Through this membership card, members receive benefits in different sectors (health, consumer goods, education, entertainment, and more). There are different types of memberships: Diamond, Gold, and Silver. The Diamond membership provides all privileges, discounts, and reductions on all services from the first to the fifth star. The Gold membership offers benefits from the first to the fourth star, while the Silver membership grants benefits from the first to the third star. After selecting the membership type, the duration of the membership can be chosen, ranging from six months to five years.",
    "title2": "Membership Table",
    "title3": "Locations and Discounts",
    "download": "Click to Download.",
    "dropdown": {
      "title": "Membership",
      "f1": "Apply for Membership",
      "f2": "About Memberships"
    }
  },
  "surveying": {
    "title": "You will learn about surveying instruments such as the level and total station, and you will practice using them in the field.",
    "subtitle": "Explanation of the scientific principles of surveying engineering",
    "dis1": "(Introduction to surveying - Plane and geodetic surveying – Coordinate systems – Angle and deviation calculations – Roubier and chain - Benchmark level and network leveling). Surveying instruments (Level - Total Station)",
    "subtitle2": "Explanation of instruments and site work",
    "dis2": "(Steps for implementing network leveling on-site – Explanation of the level and reading elevations – Leveling ceilings and floors – Checking excavation and replacement levels - Explanation of the Total Station and steps for surveying and marking – Data retrieval and transfer methods - Monitoring excavation and backfilling work and operating heavy equipment - Surveying and marking methods). A comprehensive course on surveying programs (Sokkia Link - AutoCAD 2D & 3D).",
    "subtitle3": "Explanation of office technical work",
    "dis3": "(Network leveling calculations and system conversions – Calculating excavation and backfilling quantities and differentiating between soil layers – Data transfer methods between the Total Station and a computer – Types of surveying files - Explanation of ProLink software – Explanation of Sokkia Link software – Explanation of AutoCAD software – Reading blueprints).",
    "subtitle4": "After completing the course, you will be able to:",
    "p1": "Pass any interview at any company.",
    "p2": "Work as a construction surveyor in the architectural field.",
    "p3": "Work as a road, water, and sewage surveyor in infrastructure projects.",
    "p4": "Work in technical office surveying.",
    "p5": "In other words, become an expert surveyor in all fields.",
    "subtitle5": "Course benefits",
    "p6": "You can join the General Syndicate of Surveying Engineers and pass the skill assessment test at the Ministry of Manpower, allowing you to change your job title on your national ID.",
    "p7": "The course certificate is officially accredited for work inside and outside the country. You will receive a certificate certified by the institution for vocational training in surveying and another certificate for work and training in surveying, authenticated by the real estate registry.",
    "p8": "Training is conducted using the latest surveying instruments and software.",
    "p9": "Training is provided by specialized engineers working in major companies inside and outside Egypt.",
    "p10": "The number of trainees in each group does not exceed 10 people for better comprehension. The study duration is one month."
  },
  "technical": {
  "title": "How to Become a Skilled Technical Office Engineer and Master All the Details You Need for Your Future Work. The Technical Office course has become one of the most in-demand fields in the job market, but many students and graduates are unaware of the responsibilities of a technical office engineer, the fields they will work in, and whether it's better for them to work in design or technical office engineering.",

  "p1": "We will learn everything about bids and tenders in detail, their types, how project tenders are announced, and the criteria for selecting the contracting company to execute the project. We will also understand the documents submitted in a tender and how to prepare them.",

  "p2": "We will discuss the differences between (Shop Drawings), (Tender Drawings), and (As-Built Drawings).",

  "p3": "We will fully understand the roles of the owner, consultant, general contractor, and subcontractors in the project.",

  "p4": "We will learn what a technical envelope and a financial envelope are. We will also learn about inquiry sessions, bid opening sessions, and negotiation sessions, as well as the differences between open tenders, limited tenders, and direct awarding.",

  "p5": "We will understand what temporary security, initial security, final security, and letters of guarantee are, along with their functions. Additionally, we will learn how financial transactions occur between companies in the contracting field, how financial payments and project advances are processed, and how the contractor ensures their rights in the advance payment.",

  "p6": "We will learn what a BOQ (Bill of Quantities) is, how project estimations are prepared, and what the project's technical specifications, general and special conditions are, along with how they are prepared.",

  "p7": "We will understand the differences between a site handover report, an initial acceptance report, and a final acceptance report, as well as what work guarantees and the ten-year guarantee of a project mean.",

  "p8": "We will learn together about construction contracts and their types.",

  "p9": "We will understand what the Tenders and Auctions Law No. 182 of 2018 is and its key provisions. We will also discuss the most important articles of the Unified Building Law.",

  "p10": "We will cover the essential stages of a construction project in detail: Feasibility study stage, Design and project documentation stage, Project bidding stage, Contracting stage, Execution stage, and Project handover stage.",

  "p11": "Excel: We will introduce the program, how to create Excel sheets for quantity surveying, rebar detailing, and how to utilize Excel to maximize its potential.",

  "p12": "Pricing: We will learn how to perform cost analysis for project items, calculate the actual cost of each item, price the bill of quantities, add profit margins and administrative expenses, and understand the difference between Direct Cost and Indirect Cost.",

  "p13": "We will understand labor and equipment productivity rates, as well as material consumption rates.",

  "p14": "We will learn how contractors are compensated for price differences and review the provisions of the Tenders and Auctions Law No. 182 of 2018.",

  "p15": "Payment Certificates: We will learn what payment certificates are, how to prepare them in detail, apply them during the lecture, and create a complete payment certificate while addressing potential challenges.",

  "p16": "We will understand deductions from payment certificates, tax, and insurance withholdings.",

  "p17": "Quantity Surveying: We will learn the difference between engineering quantity surveying and actual quantity surveying and when to use each.",

  "p18": "We will learn how to survey quantities for different work items (concrete and finishes) and incorporate these items into the bill of quantities.",

  "p19": "We will understand what additions and deductions mean.",

  "p20": "How to create a quantity surveying sheet.",

  "p21": "Rebar detailing for different structural elements.",

  "p22": "Understanding splice locations: Footings, Tie Beams, Raft Foundation, Columns, Beams, Flat Slab, Solid Slab, Stairs.",

  "p23": "We will also learn how to minimize steel waste using the Cutting Optimization program.",

  "p24": "The software programs we will use and apply: Excel, AutoCAD, Cutting Optimization, AutoRebar, and AutoCAD Structure Detailing.",

  "p25": "At the end of the course, a real project will be applied during the lessons."
},
"gis": {
    "title": "In this training, you learn from experts with years of experience in the field and get truly prepared for the job market—it's not just a course and that's it.",
    "title2": "The diploma lasts for 3 months or more and consists of 24 practical lectures, with two lectures conducted per week.",
    "h1": "The diploma is divided into 3 levels as follows",
    "h2": "Level One",
    "p1": "Gis Basic ... Basic level in Geographic Information Systems",
    "p2": "What is Gis ... Introduction to Geographic Information Systems",
    "p3": "Projection & Datum ... Projections & Geodetic Datum",
    "p4": "Spatial Data ... Types of Spatial Data",
    "p5": "Geoprocessing ... Processes and Data Processing",
    "p6": "Gis Application ... Applications of Geographic Information Systems",
    "p7": "Gis Users ... GIS Users",
    "p8": "Georeference ... Georeferencing",
    "p9": "Create Database ... Creating Geographic Databases",
    "p10": "Digitizing ... Digitization (Drawing)",
    "p11": "Selection ... Querying",
    "p12": "Topology ... Geometric Rules",
    "p13": "Layout ... Output",
    "h3": "Level Two",
    "f1": "Gis Advanced ... Advanced level in Geographic Information Systems",
    "f2": "Part One ... Producing Accurate Spatial Data",
    "f3": "Advanced Editing ... Professional Editing",
    "f4": "Network ... Networks",
    "f5": "Building Geocode ... Geocoding for Buildings",
    "f6": "Query ... Query Language",
    "f7": "Ex-Data _ template schema ...",
    "f8": "Pre-prepared data for training and building display structures and fixed project drawings",
    "f9": "Project ... A final real-world project similar to job market tasks",
    "f10": "Part Two - Arc Toolbox Tools",
    "f11": "3D Analyst Tools ... 3D Analysis Tools",
    "f12": "Analysis Tools ... Analysis Tools",
    "f13": "Cartography Tools ... Cartography Tools",
    "f14": "Conversion Tools ... Conversion Tools",
    "f15": "Data Interoperability Tools ... Data Interoperability Tools",
    "f16": "Data Management Tools ... Data Management Tools",
    "f17": "Editing Tools ... Editing Tools",
    "f18": "Geocoding Tools ... Geocoding Tools",
    "f19": "Geostatistical Analyst Tools ... Geostatistical Analysis Tools",
    "f20": "Linear Referencing Tools ... Linear Referencing Tools",
    "f21": "Multidimension Tools ... Multidimensional Tools",
    "f22": "Network Analyst Tools ... Network Analysis Tools",
    "f23": "Parcel Fabric Tools ... Parcel Fabric Tools",
    "f24": "Schematics Tools ... Schematics Tools",
    "f25": "Server Tools ... Server Tools",
    "f26": "Space Time Pattern Mining Tools ... Space-Time Pattern Mining Tools",
    "f27": "Spatial Analyst Tools ... Spatial Analysis Tools",
    "f28": "Spatial Statistics Tools ... Spatial Statistics Tools",
    "f29": "Tracking Analyst Tools ... Tracking Analysis Tools",
    "h4": "Level Three",
    "k1": "Gis Application ... Applications in Geographic Information Systems",
    "k2": "Part One - Model Builder",
    "k3": "What is A Model ... Definition of Modeling and How to Create It",
    "k4": "NDVI Model ... Vegetation Cover Analysis Model",
    "k5": "DEM Model ... Digital Elevation Model Analysis",
    "k6": "IDW Model ... Urban Analysis Model",
    "k7": "Workshop on QGIS & ArcGIS Pro",
    "k8": "Part Two - Arc Scene Analysis ... Arc Scene Interface Explanation and Usage",
    "k9": "Google Earth ... Complete Explanation of Google Earth",
    "k10": "Digital Elevation Model ... Digital Elevation Model",
    "k11": "Hydrological Analysis ... Hydrological Analysis",
    "k12": "Digital Shoreline Analysis System ... Shoreline Analysis",
    "k13": "Urban Analysis ... Urban Analysis"
},
"graphic": {
    "title": "At Albenaa, you train and learn from experts and professionals with years of experience in the field. You are truly prepared for the job market—not just taking a course and moving on. Our Graphic Design Diploma takes you from beginner to professional with exclusive discounts and offers that won’t be repeated.",
    "subtitle": "The diploma is divided into two levels.",
    "subtitle2": "Level One",
    "dis": "It consists of three essential programs that every designer must master: Photoshop, Illustrator, and InDesign. Our mission at this level is to make you an expert in these tools, understand their purpose, when to use them, and the differences between them. You'll also learn all the professional details that not everyone shares.",
    "p1": "We learn all types of designs, including printed materials with their techniques and details, such as",
    "p2": "Business card",
    "p3": "Flyer",
    "p4": "Brochure",
    "p5": "Menu",
    "p6": "Roll-up",
    "p7": "Banner",
    "p8": "Book Cover",
    "p9": "Magazine",
    "p10": "Professional photo manipulation",
    "p11": "Cartoon characters",
    "p12": "Professional photo editing and restoration",
    "subtitle3": "Level Two",
    "dis2": "What sets Albenaa apart is that we don’t just stop at making you an expert in the three programs—we also prepare you for the job market. We cover fields such as Social Media Design, Logo Design, and Digital Painting.",
    "f1": "How to receive a brief from the client",
    "f2": "The correct dimensions for each design",
    "f3": "Professional sources for generating design ideas",
    "f4": "How to professionally source materials for your design (images, fonts, vectors, and more)",
    "f5": "How to develop a unique design style",
    "f6": "How to unify your campaign around your created style",
    "f7": "How to market yourself as a designer and start working as a freelancer",
    "f8": "Logo Design content",
    "f9": "How to generate an idea for your logo",
    "f10": "How to sketch a logo, even if you don’t know how to draw",
    "f11": "How to convert your sketch into a digital logo using Illustrator",
    "f12": "How to use grids and the golden ratio in logo design",
    "f13": "How to design professional typography for your logo",
    "f14": "How to create a professional presentation for your logo on design platforms",
    "f15": "A special workshop for beginners covering drawing basics and how to use a graphic tablet, with hands-on exercises",
    "f16": "Instructors with over 4 years of teaching experience and more than 8 years of experience in the graphic design industry",
    "f17": "All content is recorded, meaning you will receive a video after each lecture to review the material."
},
"spaceDiploma": {
  "title": "A Comprehensive Diploma in the Field of Surveying - A Technical Surveying Qualification Diploma for General Surveyors and Surveying Specialists, including Land Measurement, Canal Rehabilitation, Drainage, Construction, and Roadworks. This diploma consists of 8 courses in one comprehensive and integrated program, from beginner to professional level.",
  "sub1": "Diploma Content",
  "dis1": "At the beginning of the surveying diploma with Al-Benaa, an introduction is provided.",
  "sub2": "Scientific Content",
  "dis2": "Explanation of the scientific principles of surveying engineering: (Introduction to surveying science - Plane and geodetic surveying – Coordinate systems – Angle and deviation calculations – Leveling and chains – Benchmarking and grid leveling – Contour and land terrain).",
  "sub3": "Course 1",
  "dis3": "Surveying Instruments (Leveling Instrument - Total Station - Handheld GPS), covering: Explanation of surveying devices and fieldwork: (Steps for executing grid leveling on-site – Understanding leveling instruments and reading elevation levels – Leveling for ceilings and floors – Checking excavation and filling levels – Explanation of the Total Station, surveying and setting-out steps – Data retrieval and transfer methods – Monitoring excavation, backfilling, and heavy equipment operations – Technical differences between roadworks, drainage, infrastructure, and construction – Explanation of handheld GPS – Surveying and setting-out techniques – Usage of the device – Satellite connectivity and coordinate determination with the highest accuracy – Surveying urban areas, intersections, and roads).",
  "sub4": "Course 2",
  "dis4": "A comprehensive course on surveying software (ProLink - Sokkia Link - Surfer - Civil 3D - AutoCAD 2D & 3D), covering: Technical office work: (Grid leveling calculations and system conversions – Excavation and backfilling volume estimation – Soil layer separation – Preparing technical reports for consultants and contractors – Data transfer between Total Station and computer – Types of surveying files – Explanation of ProLink software – Explanation of Sokkia Link software – Explanation of AutoCAD software – Explanation of Land Desktop software – Explanation of Surfer software – Finalizing topographic and contour maps – Reading and interpreting plans).",
  "sub5": "Course 3",
  "dis5": "A comprehensive course on roadworks, covering both design and execution.",
  "sub6": "Course 4",
  "dis6": "A comprehensive course in construction surveying.",
  "sub7": "Course 5",
  "dis7": "A comprehensive course in sanitary drainage surveying.",
  "sub8": "Course 6",
  "dis8": "An architectural design course.",
  "sub9": "Course 7",
  "dis9": "A bonus course from Al-Benaa on irrigation canal lining and covered drainage, including quantity estimation.",
  "sub10": "Course 8",
  "dis10": "Another bonus course from Al-Benaa introducing marine surveying, navigation systems, and equipment used for depth measurement, route determination, gas pipeline installation, and extraction station construction.",
  "sub11": "Upon Completing the Course, You Will Be Able To",
  "p1": "Pass any interview at any company.",
  "p2": "Work as a construction surveyor in the architectural field.",
  "p3": "Work as a road, water, and drainage surveyor in the infrastructure sector.",
  "p4": "Work in the technical office.",
  "p5": "Become a proficient surveyor in all fields.",
  "sub12": "Course Benefits",
  "f1": "You can join the General Syndicate of Surveying Engineers and pass the skill assessment test at the Ministry of Manpower, allowing you to change your job title on your national ID card.",
  "f2": "The course certification is officially accredited for use inside and outside the country. You will receive three certificates: The first is a vocational training certificate in surveying with a serial number and barcode linked to the institution’s official website (www.albennaa.com). The second is an experience certificate from the institution verifying work experience in surveying as a General Surveyor or Surveying Specialist. The third is a notarized certificate verifying work and training in surveying, which can be authenticated at the Real Estate Registration Office (authentication incurs additional fees). You will also receive an institution-issued ID card with your professional title.",
  "f3": "Technical support is provided during and after the course.",
  "f4": "The training consists of 20% theory and 80% practical work.",
  "f5": "Training is conducted using the latest surveying equipment and software.",
  "f6": "Training is delivered by specialized engineers with experience in major companies inside and outside Egypt.",
  "f7": "Eligible Candidates for the Course",
  "f8": "The course is designed for students and graduates of the Institute of Surveying, Irrigation, and Drainage, as well as graduates of Agriculture, Geography (Arts and Education faculties), Engineering, and anyone interested in learning surveying.",
  "f9": "Instructor: Engineer Mostafa Yehia",
  "f10": "Duration: 3 months"
},
"quantity": {
    "title": "How to Become a Skilled Quantity Surveyor and Master All the Details You Need for Your Job. At Al-Benaa, you train and learn from experts with years of experience in the field, preparing you for the job market—not just another course.",
    "f1": "Learn the concepts of quantity surveying, site excavation, and performing various material quantity calculations for projects.",
    "f2": "Learn how to calculate excavation quantities, estimate backfilling volumes, and determine construction costs and project evaluations.",
    "f3": "Learn how to calculate excavation works, concrete quantities for foundations, and reinforcement quantities for columns and tie beams.",
    "f4": "Learn how to calculate concrete and reinforcement quantities for structural elements in buildings.",
    "f5": "Enhance participants' knowledge of technical specifications.",
    "f6": "Enable participants to read, understand, and create architectural and structural drawings.",
    "f7": "Gain the ability to prepare quantity takeoff sheets.",
    "f8": "Acquire skills in building management, design cost estimation, contract management, and procurement.",
    "f9": "Learn fundamental management concepts essential for civil engineers, particularly site engineers.",
    "f10": "Learn how to calculate finishing quantities, including brickwork, tiling, aluminum, carpentry, and stonework.",
    "f11": "Work with all modern quantity surveying software.",
    "f12": "The course is designed to equip participants with the skills to perform material quantity calculations, estimate construction costs, and evaluate projects. It also aims to enhance their knowledge of international standards, enable them to read and create architectural and structural plans, prepare quantity takeoff sheets, manage buildings, estimate design costs, and handle contracts and procurement. Additionally, it covers essential management concepts for civil engineers, particularly site engineers.",
    "f13": "Instructor: Eng. Mostafa Yehia / Duration: 1 month"
  },
  "site": {
    "title": "With the significant advancements in execution and major projects, we had to offer an execution course that matches the evolving job market, preparing engineers to compete and meet the high-level demands of companies and projects. This course goes beyond traditional acceptance procedures and standard work items. Once you see the content, you’ll understand how it differs from any other execution course. That’s why we present a diploma that will create a significant breakthrough in the execution field. We focus on a crucial and essential part: earthworks and foundations, in addition to traditional concrete works, their acceptance, quality control, and execution according to codes, specifications, and industry standards. The course includes extensive content, real project videos, and drawings from top consulting firms.",
    "subtitle": "Construction",
    "k1": "Understanding the general site layout and site acceptance reports.",
    "k2": "Soil investigation works.",
    "k3": "Excavation works.",
    "k4": "Concrete works.",
    "k5": "Carpentry works.",
    "k6": "Steel reinforcement works.",
    "k7": "Electrical installation works.",
    "k8": "Sewage pipeline installation works.",
    "k9": "Water supply pipeline installation works.",
    "k10": "Quantity surveying works.",
    "k11": "Backfilling and masonry works.",
    "k12": "Finishing works (Plastering - Plumbing & Electrical finishing - Painting - Facade finishing).",
    "k13": "Aspilt survey works for final site handover.",
    "subtitle2": "Networks and Water Supply & Sewage Stations",
    "f1": "Soil investigation and soil testing.",
    "f2": "Elevation and slope drawings.",
    "f3": "Surveying works using the Total Station device.",
    "f4": "Pipeline installation and design drawings.",
    "f5": "Excavation and leveling works.",
    "f6": "Manholes and chambers.",
    "f7": "Pipe installation, welding, and compaction works.",
    "f8": "Aspilt survey works for final site handover.",
    "p1": "Aspilt survey works for final site handover.",
    "p2": "No prior experience is required; the course starts from zero to expert level. If you already have experience, it will add significant value and enhance your skills.",
    "p3": "The course includes drawings from real projects executed by the instructor, available in AutoCAD format for download and follow-up.",
    "p4": "Strong technical support and a discussion group for follow-ups, questions, and valuable discussions.",
    "p5": "Duration: 3 months, 2 days per week."
  }


}

 
